# Generated with: brew bundle dump --describe --file=Brewfile --force
# Re-run that command after installing/removing brew packages to refresh.
# Install everything with: brew bundle --file=~/dotfiles/Brewfile

tap "charmbracelet/tap"
tap "grishka/grishka"
tap "iaminci/netstat-macos"
tap "mongodb/brew"
tap "nickustinov/tap"
tap "playcover/playcover"

# Zstandard is a real-time compression algorithm
brew "zstd"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Official Amazon AWS command-line interface
brew "awscli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# OpenType text shaping engine
brew "harfbuzz"
# Portable file server
brew "copyparty"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Isolated development environments using Docker
brew "docker-compose"
# AST-based pattern checker for JavaScript
brew "eslint"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Git extension for versioning large files
brew "git-lfs"
# Multimedia framework for research and academic purposes
brew "gpac"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Python wrapper for the various Internet Archive APIs
brew "internetarchive", link: false
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Easy way to access the system keyring service from python
brew "keyring", link: false
# Scalable user load testing tool written in Python
brew "locust"
# Deep clean and optimize your Mac
brew "mole"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# NCurses Disk Usage
brew "ncdu"
# Trigger notifications when a process completes
brew "noti"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk@17"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Utility that provides fast incremental file transfer
brew "rsync"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Display and control your Android device
brew "scrcpy"
# SMART hard drive monitoring
brew "smartmontools"
# Non-interactive SSH password auth
brew "sshpass"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Automatic TV episode file renamer that uses data from thetvdb.com
brew "tvnamer"
# Tool for creating isolated virtual python environments
brew "virtualenv", link: false
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"

# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Server and cloud storage browser
cask "cyberduck"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# HTTP(S) debugging proxy, analyzer, and client
cask "http-toolkit"
# Free and open-source media player
cask "iina"
# Menu bar calendar
cask "itsycal"
# A tiny, fast scratchpad and clipboard manager for Mac
cask "nickustinov/tap/itsypad"
# File archiver
cask "keka"
# Clipboard manager
cask "maccy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# App wrapper for Postgres
cask "postgres-app"
# Collaboration platform for API development
cask "postman"
# IDE for professional Python development
cask "pycharm"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Control windows and applications right from your trackpad
cask "swish"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"

vscode "akamud.vscode-theme-onelight"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "jeremyrajan.react-component"
vscode "kamikillerto.vscode-colorize"
vscode "keifererikson.nightfox"
vscode "mechatroner.rainbow-csv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-product-icons"
vscode "teabyii.ayu"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "xabikos.javascriptsnippets"
vscode "yandeu.five-server"

cargo "mdbook"
cargo "mdbook-aquascope"
cargo "mdbook-quiz"
